# Domain allow-list for the on-device refusal gate.
# One lowercase word per line. Feed to the converter's 'Domain words' input.
# 600 words from pokemon_kanto.txt
ability
abra
ace
acid
across
admirers
aerodactyl
affect
agatha
air
alakazam
almost
already
although
always
amber
among
amount
anne
antidote
anything
apparently
appear
appears
arbok
arcanine
area
areas
articuno
attack
attacks
awakening
away
back
badge
badges
balance
ball
balls
base
basic
battle
beat
beats
become
beedrill
bellsprout
best
better
bicycle
bike
bird
birds
birth
blaine
blastoise
blasts
blocking
blue
body
bolts
bone
bones
boulder
boulders
brock
bruno
bug
bugs
build
bulbasaur
bulk
burn
burned
burrows
butterfree
candy
capable
card
cascade
case
catch
catches
catching
category
caterpie
caught
cause
cave
caves
celadon
center
certain
cerulean
challenge
champion
change
chansey
charizard
charmander
charmeleon
choose
cinnabar
cities
city
clefable
clefairy
close
cloyster
code
coin
colonies
come
comes
common
condition
core
corner
cubone
cures
cut
damage
danger
dark
deal
deep
defeat
degrees
depending
describe
dewgong
dex
diglett
ditto
dodrio
doduo
dojo
doll
dome
doubly
dragon
dragonair
dragonite
dratini
dreams
drill
drowzee
duck
dugtrio
dust
ears
easily
eating
eats
eevee
effect
effective
eggs
eight
eighth
ekans
electabuzz
electric
electrode
element
elite
elixir
enable
enables
enemies
enemy
energy
enormous
entry
erika
escape
ether
even
ever
every
evolution
evolve
evolved
evolves
evolving
execute
exeggcute
exeggutor
exp
extended
extremely
eyes
face
fails
fainted
fairy
fall
family
farfetch
fast
fearow
feet
female
ferocious
fighting
filthy
fin
final
find
fire
fires
first
fishing
flame
flames
flap
flaps
flareon
flash
flute
fly
flying
footprints
forest
forests
form
fossil
found
four
free
frozen
fuchsia
full
fully
game
gas
gases
gastly
gather
genetic
gengar
geodude
ghost
gift
giovanni
gloom
golbat
gold
goldeen
golduck
golem
good
grass
graveler
great
grimer
ground
growlithe
grows
gyarados
gym
gyms
half
hard
harden
harder
haunter
head
heads
heal
heals
heavy
helix
hidden
hide
hideout
high
hitmonchan
hitmonlee
hm01
hm04
holds
home
horn
horns
horsea
host
huge
human
hurt
hyper
hypno
hypnosis
ice
identify
immune
include
indigo
info
inside
instantly
island
islands
item
itemfinder
items
ivysaur
jigglypuff
jolteon
jynx
kabuto
kabutops
kadabra
kakuna
kangaskhan
kanto
keeps
key
kinds
kingler
known
koffing
koga
krabby
lab
lance
lapras
large
last
lavender
leader
leaders
leaf
league
leaves
legendary
legs
lets
level
leveling
lickitung
lift
lightning
line
list
lives
living
long
lorelei
machamp
machoke
machop
made
magikarp
magmar
magnemite
magneton
mankey
mansion
map
marowak
mart
master
matchups
max
meowth
metapod
mew
mewtwo
mime
ming
mistaken
misty
moltres
moon
mouse
move
moves
muk
mushroom
mythical
name
near
needed
needs
never
new
next
nidoking
nidoqueen
nidoran
nidorina
nidorino
ninetales
normal
normally
nugget
number
oak
obtain
oddish
often
old
omanyte
omastar
onix
original
outside
pallet
paralyze
paras
parasect
parcel
people
persian
pewter
pidgeot
pidgeotto
pidgey
pikachu
pin
pinsir
places
plant
plateau
player
poison
poke
pokedex
pokemon
poliwag
poliwhirl
poliwrath
ponyta
porygon
potion
power
powerful
pre
prefers
prey
primeape
professor
protective
psi
psychic
psyduck
quick
raichu
rainbow
rapidash
rare
rarely
raticate
rattata
read
red
region
repel
resist
resistant
restore
restores
returned
revive
revived
rhydon
rhyhorn
right
road
rock
rocket
rod
rope
route
runs
sabrina
safari
saffron
said
sandshrew
sandslash
say
scope
scyther
sea
seadra
seafoam
seaking
secret
seed
seel
seen
several
shape
shell
shellder
shellfish
short
show
silph
similar
sleep
sleeping
slowbro
slowpoke
sludge
small
snorlax
soul
spearow
special
species
speed
squirtle
stage
starmie
start
starter
staryu
status
stone
stones
stores
strength
strong
strongest
super
superpower
surf
surge
swim
swimming
tadpole
tail
takes
tangela
targets
tauros
teaches
team
teeth
tentacool
tentacruel
thunder
ticket
times
tiny
tough
tower
town
toxic
trade
traded
trainer
trainers
travel
tunnel
type
types
typing
ultra
underground
use
used
uses
using
vaporeon
venomoth
venomous
venonat
venusaur
vermilion
victim
victory
victreebel
vileplume
viridian
voltorb
voucher
vulpix
wakes
walking
warning
wartortle
water
weak
weed
weedle
weepinbell
weezing
wigglytuff
wild
wings
without
years
yellow
zapdos
zone
zubat
